#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_amplify_branch.main: Refreshing state... [id=d2er6jry7l1se1/main]
aws_amplify_branch.dev: Refreshing state... [id=d2er6jry7l1se1/dev]
aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d2er6jry7l1se1/thomaskimble.com]
aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d2er6jry7l1se1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_amplify_app.thomaskimble_frontend will be destroyed
  # (because aws_amplify_app.thomaskimble_frontend is not in configuration)
  - resource "aws_amplify_app" "thomaskimble_frontend" {
      - access_token                  = (sensitive value) -> null
      - arn                           = "arn:aws:amplify:eu-west-1:287212251408:apps/d2er6jry7l1se1" -> null
      - auto_branch_creation_patterns = [] -> null
      - build_spec                    = <<-EOT
            version: 0.1
            frontend:
              phases:
                preBuild:
                    commands:
                      - npm ci
                build:
                    commands:
                      - npm run build
              artifacts:
                baseDirectory: build
                files:
                  - '**/*'
              cache:
                paths:
                  - node_modules/**/*
        EOT -> null
      - default_domain                = "d2er6jry7l1se1.amplifyapp.com" -> null
      - enable_auto_branch_creation   = false -> null
      - enable_basic_auth             = false -> null
      - enable_branch_auto_build      = true -> null
      - enable_branch_auto_deletion   = true -> null
      - environment_variables         = {
          - "_CUSTOM_IMAGE" = "amplify:al2"
        } -> null
      - id                            = "d2er6jry7l1se1" -> null
      - name                          = "thomaskimble-frontend" -> null
      - platform                      = "WEB" -> null
      - production_branch             = [
          - {
              - branch_name      = "main"
              - last_deploy_time = "2024-05-13T15:43:03Z"
              - status           = "SUCCEED"
              - thumbnail_url    = ""
            },
        ] -> null
      - repository                    = "https://github.com/ThomasOliverKimble/thomaskimble-frontend" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null

      - custom_rule {
          - source = "</^[^.]+$|\\.(?!(css|gif|ico|jpg|js|png|txt|svg|woff|ttf|map|json)$)([^.]+$)/>" -> null
          - status = "200" -> null
          - target = "/index.html" -> null
        }
      - custom_rule {
          - source = "https://thomaskimble.com" -> null
          - status = "302" -> null
          - target = "https://www.thomaskimble.com" -> null
        }
    }

  # aws_amplify_branch.dev will be destroyed
  # (because aws_amplify_branch.dev is not in configuration)
  - resource "aws_amplify_branch" "dev" {
      - app_id                      = "d2er6jry7l1se1" -> null
      - arn                         = "arn:aws:amplify:eu-west-1:287212251408:apps/d2er6jry7l1se1/branches/dev" -> null
      - associated_resources        = [] -> null
      - branch_name                 = "dev" -> null
      - custom_domains              = [] -> null
      - display_name                = "dev" -> null
      - enable_auto_build           = true -> null
      - enable_basic_auth           = false -> null
      - enable_notification         = false -> null
      - enable_performance_mode     = false -> null
      - enable_pull_request_preview = false -> null
      - environment_variables       = {} -> null
      - framework                   = "React" -> null
      - id                          = "d2er6jry7l1se1/dev" -> null
      - stage                       = "DEVELOPMENT" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - ttl                         = "5" -> null
    }

  # aws_amplify_branch.main will be destroyed
  # (because aws_amplify_branch.main is not in configuration)
  - resource "aws_amplify_branch" "main" {
      - app_id                      = "d2er6jry7l1se1" -> null
      - arn                         = "arn:aws:amplify:eu-west-1:287212251408:apps/d2er6jry7l1se1/branches/main" -> null
      - associated_resources        = [] -> null
      - branch_name                 = "main" -> null
      - custom_domains              = [] -> null
      - display_name                = "main" -> null
      - enable_auto_build           = true -> null
      - enable_basic_auth           = false -> null
      - enable_notification         = false -> null
      - enable_performance_mode     = false -> null
      - enable_pull_request_preview = false -> null
      - environment_variables       = {} -> null
      - framework                   = "React" -> null
      - id                          = "d2er6jry7l1se1/main" -> null
      - stage                       = "PRODUCTION" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - ttl                         = "5" -> null
    }

  # aws_amplify_domain_association.thomaskimble will be destroyed
  # (because aws_amplify_domain_association.thomaskimble is not in configuration)
  - resource "aws_amplify_domain_association" "thomaskimble" {
      - app_id                              = "d2er6jry7l1se1" -> null
      - arn                                 = "arn:aws:amplify:eu-west-1:287212251408:apps/d2er6jry7l1se1/domains/thomaskimble.com" -> null
      - certificate_verification_dns_record = "_7e22b1babcc35ce87edf7ed749af8856.thomaskimble.com. CNAME _7b4029c216de4ea1300d31968bd7424a.sdgjtdhdhz.acm-validations.aws." -> null
      - domain_name                         = "thomaskimble.com" -> null
      - enable_auto_sub_domain              = false -> null
      - id                                  = "d2er6jry7l1se1/thomaskimble.com" -> null
      - wait_for_verification               = false -> null

      - sub_domain {
          - branch_name = "dev" -> null
          - dns_record  = "dev CNAME ddvsgbmxbfrqs.cloudfront.net" -> null
          - prefix      = "dev" -> null
          - verified    = false -> null
        }
      - sub_domain {
          - branch_name = "main" -> null
          - dns_record  = "* CNAME ddvsgbmxbfrqs.cloudfront.net" -> null
          - verified    = false -> null
        }
      - sub_domain {
          - branch_name = "main" -> null
          - dns_record  = "www CNAME ddvsgbmxbfrqs.cloudfront.net" -> null
          - prefix      = "www" -> null
          - verified    = false -> null
        }
    }

  # aws_route53_record.thomaskimble_dev_cname will be created
  + resource "aws_route53_record" "thomaskimble_dev_cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dev.thomaskimble.com"
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.thomaskimble_legacy_cname will be created
  + resource "aws_route53_record" "thomaskimble_legacy_cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "legacy.thomaskimble.com"
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.thomaskimble will be created
  + resource "aws_route53_zone" "thomaskimble" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "thomaskimble.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

  # aws_route53_zone.thomaskimble_dev will be created
  + resource "aws_route53_zone" "thomaskimble_dev" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev.thomaskimble.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

  # aws_route53_zone.thomaskimble_legacy will be created
  + resource "aws_route53_zone" "thomaskimble_legacy" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "legacy.thomaskimble.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

  # aws_route53_zone.thomaskimble_www will be created
  + resource "aws_route53_zone" "thomaskimble_www" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "www.thomaskimble.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 6 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*